// // План:
// // 0) Дізнатися у користувача скільки разів будемо стріляти. Створити змінні під задачу.
// // 1) Створити поле. Двовимірний масив, заповнити його чимось.
// // 2) Це поле в рандомний спосіб заповнити човнами
// // 3) Сама гра. Через промт питати куди стріляємо, зробити перевірку, треба щось виводити на екран

// // Коментарі це хід моїх думок, бо задача виявилась досить складною для мене, я почистив зайве, якщо щось пропустив - вибачаюсь)

// // кількість кораблів
// let ships = 5

// // питаємо скільки разів будемо стріляти
// let shots = parseInt(prompt(`Скільки пострілів будемо мати`, "3")!)

// // змінна з розміром поля бо часто фігурує 6 (можна і без неї)
// let size = 6

// // Спочатку пустий масив
// let field = []

// // Нам треба цикл який зробить 6 рядків (кожний рядок це масив), буде повторюватись 6 разів
// for (let i = 0; i < size; i++) {
//   // Створити один рядок, рядок це масив з length = 6. Заповнимо його нулями
//   let row = new Array(size).fill(0)
//   //   запихуємо його в пустий масив
//   field.push(row)
// }

// // випадкове розташування кораблів

// // Якщо ми зробимо це через for то цикл може на одне й те саме місце поставити корабель, тут треба перевіряти умову, щоб кораблів було 5 на полі а не вийшло що менше
// // Треба змінна, щоб знати коли перестати запихувати кораблі на поле
// let placedShips = 0

// while (placedShips < ships) {
//   let row = Math.floor(Math.random() * size)
//   let col = Math.floor(Math.random() * size)

//   // якщо клітинка пуста — ставимо корабель (1- це корабель стоїть, 0 якщо пуста)
//   if (field[row][col] === 0) {
//     field[row][col] = 1

//     placedShips++
//   }
// }

// // Сама гра. Умова в задачі "Гра продовжується поки не потоплено усі кораблі або у користувача не закінчаться снаряди" це і поставимо в умову
// while (ships > 0 && shots > 0) {
//   // Питаємо у користувача куди будемо пуляти
//   let rowShot = parseInt(prompt(`Введіть рядок (1-6)`)!)
//   let colShot = parseInt(prompt(`Введіть стовпець (1-6)`)!)

//   // перевірка попадання
//   if (field[rowShot - 1][colShot - 1] === 1) {
//     alert("🔥 Попадання! Корабель потоплено")
//     field[rowShot - 1][colShot - 1] = 0
//     ships--
//   } else {
//     alert("💦 Мимо")
//   }

//   shots--

//   //   Виводимо скільки спроб залишилось
//   alert(`Залишилось кораблів: ${ships}
// Залишилось пострілів: ${shots}`)
// }

// // результат гри
// if (ships === 0) {
//   alert("🏆 Ви перемогли!")
// } else {
//   alert("❌ Снаряди закінчились. Ви програли")
// }
